// TODO: импортируйте классы Scanner и Local из пакета java.util

public class Task {

    // Точка входа в программу
    public static void main(String[] args) {
        // TODO: 1.Создайте экземпляр класса Scanner
        /*
        * Экземпляр класса Scanner необходим для считывания данных
        * пользовательского ввода с клавиатуры
        * */


        // TODO: 2.Поменяйте знак разделителя дробного числа на точку
        /*
        * Для этого необходимо использовать метод .useLocal()
        * экземпляра класса Scanner.
        * В качестве аргумента методу .useLocal() необходимо передать
        * значение переменной US класса Local
        * */


        // TODO: 3.Запросите у пользователя ввод длины и ширины прямоугольника
        /*
        * Программа должна считывать строки.
        * Используйте метод .nextLine() экземпляра класса Scanner
        * */


        // TODO: 6.Вызовите методы и сохраните результаты в переменные
        /*
        * Создайте две переменные такого же типа, что и значения,
        * возвращаемые методами .getArea() и .getPerimeter()
        * Сохраните в этих переменных результаты вычислений
        * */

        // TODO: 7.Отобразите результат на экране
        /*
        * Используйте методы для вывода результат работы программы
        * в командную строку. Оформите вывод так ка показано в примере
        * работы программы.
        * */


    }

    // TODO: 4.Реализуйте метод для нахождения площади прямоугольника
    public static float getArea(float length, float width) {
        // Замените 0 на формулу из подсказок.
        // Используйте имена параметров метода
        return 0;
    }

    // TODO: 5. Реализуйте метод для нахождения периметра прямоугольника
    public static float getPerimeter(float length, float width) {
        // Замените 0 на формулу из подсказок.
        // Используйте имена параметров метода
        return 0;
    }
}